config.org
#+title: Harry's Doom Emacs Config
#+author: Harry Tucker

# HTML and LaTeX export --------------------------------------------------------
#+setupfile: org-themes/src/white_clean/white_clean.theme
#+options: toc:nil
#+latex_class: mimore
# ------------------------------------------------------------------------------

* About
Come one, come all and see the folly of a man trying to configure a perfect
Emacs setup. First, shut up the linter:
#+begin_src elisp
;;; -*- lexical-binding: t; -*-
#+end_src

Hopefully you find this useful in some manner if you want to configure Doom
Emacs in a similar way to mine.
** Build Information
#+begin_src elisp :tangle no
(emacs-version)
#+end_src

#+RESULTS:
: GNU Emacs 30.1 (build 2, aarch64-apple-darwin24.3.0, NS appkit-2575.40 Version 15.3.1 (Build 24D70))
:  of 2025-03-07

#+begin_src elisp :tangle no
system-configuration-options
#+end_src

#+RESULTS:
: --enable-locallisppath=/usr/local/share/emacs/site-lisp --infodir=/usr/local/Cellar/emacs-mac/emacs-28.2-mac-9.1/share/info --mandir=/usr/local/Cellar/emacs-mac/emacs-28.2-mac-9.1/share/man --prefix=/usr/local/Cellar/emacs-mac/emacs-28.2-mac-9.1 --with-mac --enable-mac-app=/usr/local/Cellar/emacs-mac/emacs-28.2-mac-9.1 --with-gnutls --with-modules --with-native-compilation 'CFLAGS=-I/usr/local/opt/gcc/include -I/usr/local/opt/libgccjit/include' 'LDFLAGS=-L/usr/local/lib/gcc/12 -I/usr/local/opt/gcc/include -I/usr/local/opt/libgccjit/include'

* Configuration
** User Identification
#+begin_src elisp
;; Emacs User Identification
(setq user-full-name "Harry Tucker"
      user-mail-address "tucker.harry@outlook.com")
#+END_SRC

** Load Modules
Load configuration from separate module files for better organization.
#+begin_src elisp
;; Load modular configuration files using org-babel-load-file
;; This allows us to keep configuration organized in separate .org files
(org-babel-load-file (expand-file-name "modules/ui.org" doom-user-dir))
(org-babel-load-file (expand-file-name "modules/editor.org" doom-user-dir))
(org-babel-load-file (expand-file-name "modules/shell.org" doom-user-dir))
(org-babel-load-file (expand-file-name "modules/programming.org" doom-user-dir))
(org-babel-load-file (expand-file-name "modules/writing.org" doom-user-dir))
(org-babel-load-file (expand-file-name "modules/tools.org" doom-user-dir))
(org-babel-load-file (expand-file-name "modules/workarounds.org" doom-user-dir))
#+end_src

* Packages
I use some packages from [[https://melpa.org][MELPA]] that Doom Emacs doesn't expose through =init.el=.
These are imported using Doom's =package!= macro.
#+begin_src elisp :tangle packages.el
;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;; Doom Emacs

;; Behaviour Driven Development (BDD)
(package! feature-mode)

;; Python
(package! python-docstring) ; provides syntax highlighting and fill-paragraph
                            ; functionality

;; gRPC
(package! protobuf-mode) ; work with .proto files

;; Kubernetes
(package! kele)
(package! jsonnet-mode)

;; Org
(unpin! org-roam) ; use latest version of org-roam
(package! org-roam-ui) ; enable org-roam-ui server
(package! engrave-faces) ; comprehensive latex code output

;; PostgreSQL
(package! ; dependency of pgmacs
  pg :recipe
  (:host github
   :repo "emarsden/pg-el"))
(package!
  pgmacs :recipe
  (:host github
   :repo "emarsden/pgmacs"))

;; AI Tools
(unpin! gptel) ; use latest version of gptel, many bugs abound
(package!
  macher :recipe
  (:host github
   :repo "kmontag/macher"))
(package!
  eca :recipe
  (:host github
   :repo "editor-code-assistant/eca-emacs"
   :files ("*.el")))
;; Agent Shell Stuff
(package! shell-maker)
(package! acp)
(package! agent-shell)

;; Miscellaneous
(package! command-log-mode)
(package! prism)
(package! flyover)
(package! eat)
#+end_src

